# Input File Names

In [44]:
import pandas as pd
import numpy as np

Google_Forms_File_Name = 'Complete_List.xlsx' # Name of downloaded file from Google Forms in Excel format
AllSMS_CVS_File_Name =  'final_sms.csv'   # File Generated from Super Backup

# Read Data from Google Forms File

In [45]:
table = pd.read_excel(Google_Forms_File_Name) # Read the Excel File
txidlist = table[["Name", "Transaction Medium", "Txn Id:"]] # Select the tables that I want to display or work on
List_GoogleForms_TxIDs = list(txidlist['Txn Id:']) #Put all the TxID from Google Forms in a List

print("Totle Number of Entries:", len(List_GoogleForms_TxIDs) )

Totle Number of Entries: 749

# View of the Table with TxID that we are dealing with

In [46]:
txidlist.sample(5)

         Name Transaction Medium      Txn Id:
296  Name 294              bkash  01883697511
194  Name 192              bkash   8AF3WJURJV
516  Name 514              bkash   8AJ324KZB1
625  Name 623              bkash   8AK62P7GEC
75    Name 73              Nogod     70NUT1I6

# Read The SMS

In [47]:
sms = pd.read_csv(AllSMS_CVS_File_Name)

bKashList = sms.loc[sms['phoneNumber'] == 'bKash' ][["phoneNumber", "message"]] # Seperate bKash SMS
NagadList = sms.loc[sms['phoneNumber'] == 'NAGAD' ][["phoneNumber", "message"]] # Seperate Nagad SMS

BaN = [bKashList, NagadList] # Put both Bkash & Nagad Lists together
MergeBkashNagad = pd.concat(BaN) # Merge them together

All_Bkash_Nagad_SMS = list(bKashList['message']) #Convert the SMS to list

In [48]:
success_count = 0
unmatch = 0
mismatch_table = pd.DataFrame( [["Name", "Transaction Medium", "Google Forms Entry"]] )
match_table = pd.DataFrame( [["Name", "Transaction Medium", "Txn Id:"]] )

for indx, row_data in txidlist.iterrows(): # Itterate over the Google Forms Table
                                           # | row_data[0]: Name | row_data[1]: Transaction Medium | row_data[2]: Txn Id |
    count = False
    for each_sms in All_Bkash_Nagad_SMS: # Select each each SMS
        if row_data[2] in each_sms.split(' '): # Break words in list and check if any TxID match with any word
            success_count = success_count + 1
            count = True
            match_table = match_table.append([[ row_data[0], row_data[1], row_data[2] ]]) #Entry to Match table if match found
            
            
    if count == False: #If anything didnt match, add row to mismatch table.
        unmatch = unmatch + 1
        mismatch_table = mismatch_table.append([[ row_data[0], row_data[1], row_data[2] ]]) #Entry to Mismatch table if match not found
        
print("\nTotal Automatic Match - ", success_count)
print("Total Automatic unmatch - ", unmatch)

Total Automatic Match -  533
Total Automatic unmatch -  216

In [49]:
match_table.sample(10)

          0      1           2
0  Name 193  bkash  8AF8WKTNFO
0  Name 635  bkash  8AK72QCAMF
0  Name 648  bkash  8AK22RZ6K2
0  Name 469  bkash  8AJ31POCLF
0  Name 331  bkash  8AH30DKOUB
0  Name 251  bkash  8AG7WXRY6Z
0  Name 689  bkash  8AK22VLDV4
0  Name 361  bkash  8AH00Y35PI
0  Name 630  bkash  8AK92Q4UOD
0  Name 143  bkash  8AE4W7C3CI

In [69]:
mismatch_table.sample(10)

          0       1           2
0  Name 729   bkash  8AM5401Q77
0  Name 364   bkash  8AH90Z7V0V
0  Name 437  Rocket  2112520715
0  Name 290   bkash  8AG006FIGA
0  Name 235  Rocket  2108485484
0  Name 161   bkash  8AF4WBP8SA
0  Name 380   bkash  8AI516FA17
0  Name 599   bkash  8AK12J0HY9
0  Name 381   bkash  8AI916IJ9L
0   Name 73   Nogod    70NUT1I6